export default [
    {
        id: 'q1',
        text: 'Какое из следующих определений лучше всего описывает React.js?',
        answers: [
            'Библиотека для создания пользовательских интерфейсов с помощью декларативного кода.',
            'Библиотека для управления состоянием в веб-приложениях.',
            'Фреймворк для создания пользовательских интерфейсов с помощью императивного кода.',
            'Библиотека, используемая только для создания мобильных приложений.',
        ],
    },
    {
        id: 'q2',
        text: 'Для какой цели служат хуки React?',
        answers: [
            'Возможность использования состояния и других возможностей React в функциональных компонентах.',
            'Создание отзывчивых макетов в приложениях React.',
            'Обработка ошибок в приложении.',
            'Часть библиотеки Redux для управления глобальным состоянием.',
        ],
    },
    {
        id: 'q3',
        text: 'Можете ли вы определить, что такое JSX?',
        answers: [
            'Расширение JavaScript, которое добавляет HTML-подобный синтаксис в JavaScript.',
            'Библиотека JavaScript для создания динамических пользовательских интерфейсов.',
            'Специальная версия HTML, которая была специально создана для React.',
            'Инструмент для выполнения HTTP-запросов в приложении React.',
        ],
    },
    {
        id: 'q4',
        text: 'Какой самый распространенный способ создания компонента в React?',
        answers: [
            'Определив функцию JavaScript, которая возвращает рендерируемое значение.',
            'Определив пользовательский HTML-тег на JavaScript.',
            'Создав файл с расширением .jsx.',
            'Используя ключевое слово "new", за которым следует имя компонента.',
        ],
    },
    {
        id: 'q5',
        text: 'Что подразумевается под термином "состояние React"?',
        answers: [
            'Объект в компоненте, который хранит значения и может вызывать рендеринг компонента при изменении.',
            'Стадия жизненного цикла, в которой находится React-компонент.',
            'Общее состояние React-приложения, включая все реквизиты и компоненты.',
            'Библиотека для управления глобальным состоянием в React-приложениях.',
        ],
    },
    {
        id: 'q6',
        text: 'Как вы обычно отображаете содержимое списков в приложениях React?',
        answers: [
            'Используя метод map() для итераций по массиву данных и возвращая JSX.',
            'Используя цикл for() для выполнения итераций по массиву данных и возврата JSX.',
            'Используя метод forEach() для выполнения итераций по массиву данных и возврата JSX.',
            'Используя метод loop() для выполнения итераций по массиву данных и возврата JSX.',
        ],
    },
    {
        id: 'q7',
        text: 'Какой подход НЕ может быть использован для условного отображения содержимого?',
        answers: [
            'Использование синтаксиса шаблона #if.',
            'Использование тернарного оператора',
            'Использование оператора &&.',
            'Использование оператора if-else.',
        ],
    },
];